---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings)
source: html/db46f016-6524-28d1-ad1d-3bbe1a686814.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.IsEqual Method

Compares two vector settings objects.

## Syntax (C#)
```csharp
public bool IsEqual(
	AnalysisDisplayVectorSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings`) - Vector settings object to compare with.

## Returns
True if objects are equal, false otherwise.